LEXICON_ALL = {
    'start': '<b>Добро пожаловать! v1.1 beta</b>\n\n'
             '/give_id - получить ID\n\n'
             'Есть вопросы?\n'
             '/help_student - если ученик\n'
             '/help_teacher - если преподаватель\n\n'
             'Остались вопросы?\n'
             'Пиши - <code>@helperSarahh</code>\n\n'
             'Чтобы начать пользоваться выбери роль!',
    'help_student': '/start - чтобы начать пользоваться\n'
                    '/start - что-то пошло не так\n'
                    ,

    'help_teacher': '/start - чтобы начать пользоваться\n'
                    '/start - что-то пошло не так\n'
                    ,
    'payed_right': '✅ Оплата принята ✅',
    'payed_not_right': '❌ Ожидается оплата ❌',
    'incorrect_input': 'Что-то пошло не так...\n'
                       'Я не знаю, что ответить🤷‍♂️🤷‍♀️🤷\n'
                       'Нажми /start, чтобы начать заново',
    'give_id': '<b>Ваш ID: <code>{}</code></b>',
    'ok': 'Ок',
}

LEXICON_MENU = {
    '/start': 'Начало работы бота',
    '/help_student': 'Справочник для ученика',
    '/help_teacher': 'Справочник для преподавателя'
}
