LEXICON_TEACHER = {
    'authorization': '👤 Авторизация',
    'registration': '🆕 Регистрация️',
    'menu_identification': '🚪🚪🚪<b>МЕНЮ ВХОДА</b>🚪🚪🚪\n\n'
                           'Вы можете:\n'
                           '    - <u>авторизоваться</u> (если уже зарегистрированы)\n'
                           '    - <u>зарегистрироваться</u> (если заходите в первый раз)',
    'fill_name': 'Пожалуйста, введите Ваше имя!⤵️',
    'not_fill_name': 'Упс! Ошибка! Что-то не похоже на имя!\n'
                     'Попробуйте еще раз!😉',
    'fill_surname': "Спасибо! А теперь введите Вашу фамилию!☺️",
    'not_fill_surname': 'Упс! Ошибка! Что-то не похоже на фамилию!\n'
                        'Попробуйте еще раз!☺️',
    'fill_phone': 'Успех!\nСейчас потребуется ваш номер телефона!📞\n'
                  'Формат ввода: +7...(10 цифр вместо многоточия)',
    'not_fill_phone': 'Что-то пошло не так... Попробуйте еще раз!😇\n'
                      'Формат ввода: +7...(10 цифр вместо многоточия),\n'
                      'Например: +79108872307',
    'fill_bank': '💳 Введите названия <b>банка/банков</b> 💰\n\n'
                 'Если нужно указать несколько банков — разделяйте названия через <b>"/"</b>\n\n'
                 '❌ Другие форматы система <b><i>не примет</i></b>!\n\n'
                 'Примеры ввода:\n'
                 '  1️⃣ АльфаБанк\n'
                 '  2️⃣ Сбербанк/Тинькофф\n\n'
                 '⬇️ Пишите ниже ⬇️',
    'not_fill_bank': 'Не совсем похоже на название банка!\n'
                     'Может Вы забыли, что кроме букв можно '
                     'использовать только "/"!🧐\n'
                     'Попробуй еще раз!😋',
    # 'fill_penalty': 'Почти все! Здесь мы поработаем с '
    #                 '<b>системой пенальти</b>!⚽️\n Варианты ввода:\n'
    #                 '    1. <u>0</u> - если не хотите, чтобы система работала🤷\n'
    #                 '    2. <u>Количество часов</u>, за которое у ученика'
    #                 ' будет закрываться отмена занятий!🙆‍♀️',
    'fill_penalty': 'Почти все! В данный момент система пенальти недоступна!\n'
                    'Введите <u>0</u>, чтобы продолжить🙆‍♀️',
    'not_fill_penalty': 'Кажется вы ввели не число!😞\n'
                        'Варианты ввода:\n'
                        '    1. <u>0</u> - если не хотите,\n чтобы система работала🤷\n'
                        '    2. <u>Количество часов</u>, за которое у ученика🙆‍♀️'
                        'будет закрываться отмена занятий!☺️',
    'fill_until_time_notification': '⏰ <b>За какое время до занятия присылать'
                                    ' уведомление?</b>\n\n'
                                    'Формат времени <b><u>ЧАСЫ:МИНУТЫ</u></b>\n'
                                    '✨ Например:\n'
                                    '  • 01:30 — за полтора часа\n'
                                    '  • 24:00 — за сутки\n'
                                    '  • 03:00 — за три часа\n\n'
                                    '📌 Диапазон значений:'
                                    ' от <b>00:01</b> до <b>99:99</b>',
    'not_fill_until_time_notification': '😊 <b>Ой, кажется, формат не распознан!</b>\n\n'
                                        'Попробуйте еще раз!\n'
                                        'Формат времени <b><u>ЧАСЫ:МИНУТЫ</u></b>\n'
                                        '✨ Например:\n'
                                        '  • 01:30 — за полтора часа\n'
                                        '  • 24:00 — за сутки\n'
                                        '  • 03:00 — за три часа\n\n'
                                        '📌 Диапазон значений:'
                                        ' от <b>00:01</b> до <b>99:99</b>\n\n'
                                        'Вы почти у цели! ✨',
    'fill_daily_schedule_mailing_time': '⏰ <b>Во сколько Вам удобно получать ежедневное'
                                        ' расписание?</b>\n\n'
                                        'Формат времени <b><u>ЧАСЫ:МИНУТЫ</u></b>\n'
                                        '✨ Например:\n'
                                        '  🌅 08:00 — утреннее напоминание\n'
                                        '  ☕ 12:30 — обеденное время\n'
                                        '  🌙 21:00 — вечерний просмотр\n\n'
                                        '📌 Диапазон значений:'
                                        ' от <b>00:01</b> до <b>23:59</b>',
    'not_fill_daily_schedule_mailing_time': '🔍 <b>Кажется, я не смог распознать время...</b>\n\n'
                                            'Попробуйте еще раз!\n'
                                            'Формат времени <b><u>ЧАСЫ:МИНУТЫ</u></b>\n'
                                            '✨ Например:\n'
                                            '  🌅 08:00 — утреннее напоминание\n'
                                            '  ☕ 12:30 — обеденное время\n'
                                            '  🌙 21:00 — вечерний просмотр\n\n'
                                            '📌 Диапазон значений:'
                                            ' от <b>00:01</b> до <b>23:59</b>\n',
    'fill_daily_report_mailing_time': '⏰ <b>Введите время для отправки отчета за день</b>\n\n'
                                      'Формат времени <b><u>ЧАСЫ:МИНУТЫ</u></b>\n'
                                      '✨ Например:\n'
                                      '  🌆 18:30 — после рабочего дня\n'
                                      '  🌙 20:00 — вечернее время\n'
                                      '  🌃 23:00 — перед сном\n\n'
                                      '📌 Диапазон значений:'
                                      ' от <b>00:01</b> до <b>23:59</b>\n\n'
                                       '<i>После отправки отчета Вам, всем ученикам, которые не '
                                      'оплатили занятие будет выслано уведомление о зачислении в ⛓️👮Должники</i>',
    'not_fill_daily_report_mailing_time': '⏱ <b>Неверный формат времени!</b>\n\n'
                                          'Формат времени <b><u>ЧАСЫ:МИНУТЫ</u></b>\n'
                                          '✨ Например:\n'
                                          '  🌆 18:30 — после рабочего дня\n'
                                          '  🌙 20:00 — вечернее время\n'
                                          '  🌃 23:00 — перед сном\n\n'
                                          '📌 Диапазон значений:'
                                          ' от <b>00:01</b> до <b>23:59</b>\n\n',
    'fill_cancellation_notification': '✔️<b>Вы хотите получать уведомления об отмене '
                                      'занятий?</b>\n\n'
                                      '🔹 <i><b>ДА</b></i> → укажите, на сколько дней вперед получать '
                                      'оповещения об отмене:\n'
                                      '  • 1 — только отмены на сегодня\n'
                                      '  • 2 — сегодня + завтра\n'
                                      '  • 3 — и так далее (сколько нужно дней)\n\n'
                                      '🔸 <i><b>НЕТ</b></i> → введите 0\n',
    'not_fill_cancellation_notification': 'Что-то не так...😾\n'
                                          'Напишите число большее нуля!',
    'now_registered': 'Вы уже зарегистрированы!',
    'not_registered': 'Вы еще не зарегистрированы!',
    'access_registration_profile': '<b>💥💥Вы зарегистрированы!💥💥</b>\n\n',
    'back': '<<',
    'header_seven_days_teacher': '📍 Внизу находятся кнопки с датам на неделю вперед.\n'
                                 '🗓️ Выберите <i><b>день</b></i>, с которым хотите поработать!',
    'header_config_teacher': '📌📌📌 <b>{} - {}</b> 📌📌📌\n\n'
                             '[ 📅 ] <b>Моё расписание</b>\n'
                             'Ваши занятия на день\n'
                             '[ ✏️ ] <b>Редактирование</b>\n'
                             'Добавить или удалить время работы\n'
                             '[ 💰 ] <b>Платежи</b>\n'
                             'Подтверждение оплаты учеников\n',
    'go_menu_identification': 'В меню входа⤵️',
    'lessons_week_teacher': '🎓 Занятия',
    'schedule_teacher': '✏️ Редактирование',
    'confirmation_pay': '💰 Платежи',
    'schedule_show': '📅 Мое расписание',
    'settings_teacher': '️⚙ ️Настройки',
    'management_students': '🎎 Управление учениками',
    'main_menu_authorization': '👑👑👑<b>ГЛАВНОЕ МЕНЮ</b>👑👑👑\n\n'
                               'Выберите, что хотите сделать⤵',
    'schedule_teacher_menu': 'Давайте поработаем с настройкой вашего расписания'
                             ' на 7 дней вперед!🏋️‍♂️\nВыберите день для работы!',
    'next_seven_days_kb': '⚡️{} - {}⚡️',
    'schedule_changes_add_remove': '🛠 <b>Доступные действия:</b>\n'
                                   '  • 📝 <i>Добавить</i> время занятий\n'
                                   '  • 🗑 <i>Удалить</i> рабочее время',
    'add_gap_teacher': '📝 Добавить',
    'remove_gap_teacher': '🗑️ Удалить️',
    'add_time_start': '⏰ <b>Давайте настроим Ваш рабочий график!</b>\n\n'
                      'Вам нужно указать: \n'
                      '🕒 <b>Время начала</b> и 🕓 <b>Время окончания</b>\n\n'
                      '<b>Как это сделать?</b>\n'
                      ' 1. Введите <b>начало</b> в формате ЧАСЫ:МИНУТЫ\n'
                      '   Например:\n'
                      '    • 🌞 09:00 — утренний старт\n'
                      '    • ☕ 12:30 — обеденное время\n'
                      '    • 🌙 18:00 — вечернее занятие\n\n'
                      '<i>Просто отправьте сообщение в нужном формате, и мы продолжим!</i>',
    'not_correct_format_time': '🕒 Что-то пошло не так...\nВремя не '
                               'соответствует формату <b>‼️ЧАСЫ:МИНУТЫ‼️</b>\n'
                               'Примеры:\n'
                               'Попробуйте еще раз!\n'
                               'Примеры:\n'
                               '   • 🌞 09:00 — утренний старт\n'
                               '   • ☕ 12:30 — обеденное время\n'
                               '   • 🌙 18:00 — вечернее занятие\n\n',
    'new_day_not_near': 'Увы! Но вы не можете начинать занятие '
                        'после 23:30 - не получится выставить слот⏰\n\n'
                        'Минимальная длина слота - 30 минут\n\n'
                        'Формата ввода:\n <b>‼️ЧАСЫ:МИНУТЫ‼️</b>\n'
                        'Попробуйте еще раз!🌞 ',
    'conflict_with_penalty': 'Что-то пошло не так...\n'
                             'Ученики будут попадать под пенальти🤷‍♂️\n\n'
                             'Веденное время: <u><b>{}</b></u>\n\n'
                             'Пенальти будет выписываться с <u><b>{}</b></u>'
                             ' (за <u><b>{}</b></u> часов до введенного времени)\n'
                             'Но время пенальти уже наступило!⌛️\n\n'
                             'Попробуйте еще раз!',
    'time_has_passed': 'Упс...😿 Введенное время уже наступило!\n'
                       'Попробуйте снова!',
    'start_conflict_with_existing': 'Ошибка ввода⚠️ Стартовое время'
                                    ' пересекается/будет пересекаться с уже существующим!\n\n'
                                    'Список существующих записей:\n{}\n\n'
                                    'Введенный старт занятий: <b>{}</b>\n'
                                    'Попробуйте еще раз!',
    'add_time_start_right': 'Данные успешно сохранены!👌',
    'not_difference_thirty_min': "Время работы меньше 30 минут️🌞 \n"
                                 "Введенный старт занятий: <u><b>{}</b></u>"
                                 "\nПопробуйте еще раз!",
    'add_time_end': '⏰ 2. Теперь укажите время <b>окончания</b> в формате '
                    '<b>ЧАСЫ:МИНУТЫ</b>\n'
                    'Например:\n'
                    '    • 🌞 09:00\n'
                    '    • ☕ 12:30\n'
                    '    • 🌙 18:00\n\n'
                    '<i>Просто отправьте сообщение в нужном формате, и мы продолжим!</i>',
    'end_bigger_start': "Упс...😿\nВремя окончания занятий наступает раньше "
                        "стартового времени!\n"
                        "Время старта занятий: <b>{}</b>\n"
                        "Попробуйте снова!",
    'end_conflict_with_existing': 'Ошибка ввода⚠️ Время окончания '
                                  'пересекается/будет пересекаться'
                                  ' с уже существующим!\n\n'
                                  'Список существующих записей:\n{}\n\n'
                                  'Введенный старт занятий: <b>{}</b>\n'
                                  'Введенный конец занятий: <b>{}</b>\n'
                                  'Попробуйте еще раз!',
    'delete_time_start': '🚀 <b>Время для чистки!</b>\n'
                         '<i>Отметьте</i> промежуток, который нужно удалить',
    'nothing_delete_teacher_time': 'Еще не установлено расписание!',
    'confirmation_pay_menu': '💸💸💸<b>МЕНЮ ОПЛАТЫ</b>💸💸💸\n\n'
                             'Выберите день, в котором хотите поработать'
                             ' с оплатой занятий⤵️',
    'change_status_pay_menu': '<b>Нажмите</b> на кнопку, чтобы поменять статус '
                              'оплаты!\n'
                              '    ✅ - Оплачено\n'
                              '    ❌ - Не оплачено\n\n',
    # 'Варианты работы:\n'
    # '  1. Система пенальти <u>выключена</u>\n'
    # '    а) ❌ -> ✅ статус оплаты ученика будет изменён\n'
    # '        ✅ -> ❌ статус оплаты ученика будет изменён\n'
    # '  2. Система пенальти <u>включена</u>\n'
    # '    a) ✅ -> ❌ будет выписано пенальти/произойдет бан'
    # ' в случае просрочки оплаты\n'
    # '    б) ❌ -> ✅ пенальти будет отменено\n',
    'nobody_choose_lessons': "В данный момент никто не выбрал занятия!",
    'next_seven_days_pay_kb': '💰{} - {}💰',
    'student_ban': '{} {} забанен!',
    'student_give_penalty': '{} {} получил пенальти!',
    'student_remove_penalty': '{} {} - пенальти удалено!',

    'status_lesson_day_kb': '{} {} {}-{} {} руб',
    'my_schedule_menu': '📖📖<b>МЕНЮ С РАСПИСАНИЕМ📖📖</b>\n\n'
                        'Выберите день, в котором хотите посмотреть '
                        'Ваше расписание⤵️',
    'next_seven_days_schedule_teacher_kb': '🎓{} - {}🎓',
    'schedule_lesson_day': '📌📌📌 <b>{} - {}</b> 📌📌📌\n\n'
                           '🔍 Нажмите на <b><i>кнопку</i></b> — узнайте все детали! 🔍',
    'text_schedule_lesson_day': '{}{} - {}',
    'paid': '✅',
    'not_paid': '❌',
    'not_reserved': '❔',
    'show_lesson_nothing': 'Свободное время!',
    'teacher_create_slot': 'Вы еще не выставили время!',
    'information_student_lesson_day': '🦾<b>Данные об ученике</b>🦾\n'
                                      '<u>Имя</u>: {}\n'
                                      '<u>Фамилия</u>: {}\n'
                                      '<u>Город</u>: {}\n'
                                      '<u>Место обучения</u>: {}\n'
                                      '<u>Класс/курс обучения</u>: {}\n'
                                      '<u>Предмет</u>: {}\n'
                                      '<u>Стоимость</u>: {} рублей\n'
                                      '<b>{}</b>',
    'header_notifications': '🔔🔔🔔<b>УВЕДОМЛЕНИЯ</b>🔔🔔🔔\n\n'
                            '<i>Нажмите</i> на кнопку, чтобы установить или поменять '
                            '<u>время</u>',
    'send_delete_lesson_student': '❌ЗАНЯТИЕ ОТМЕНЕНО❌\n'
                                  '<u>Дата</u>: {} - {}\n'
                                  '<u>Время</u>: {}-{}\n',
    'notification_delete_sent': 'Уведомление об отмене отправлено!',
    'success_delete_lesson': 'Отмена произошла успешно!',
    'information_teacher': '🐸 Мои данные',
    'notifications_teacher': '🔔 Уведомления',
    'registration_again': '🔄 Заполнить профиль заново',
    'until_time_notification_button': '⏰ Напоминание о занятии',
    'daily_schedule_mailing_time_button': '🗓 Расписание на день',
    'daily_report_mailing_time_button': '📅 Отчет за день',
    'cancellation_notification': '🚫 Отмена занятий учениками',
    'congratulations_edit_notices': '💥💥 Данные сохранены 💥💥',
    'delete_profile': '⛔ Удалить профиль ⛔',
    'menu_settings': '⚙️⚙️⚙️⚙️<b>НАСТРОЙКИ</b>⚙️⚙️⚙️⚙️\n\n'
                     '  🔹 При обновлении профиля ваши текущие занятия <b><i>сохранятся</i></b>\n'
                     '  🔹 При удалении профиля все записи о занятиях будут безвозвратно <b><i>удалены</i></b>.\n\n'
                     '💡 Изменяйте данные аккуратно!',
    'information_about_teacher': '🐸🐸🐸<b>Информацию о Вас</b>🐸🐸🐸\n\n'
                                 '<u>Фамилия</u>: {}\n'
                                 '<u>Имя</u>: {}\n'
                                 '<u>Номер телефона</u>: {}\n'
                                 '<u>Банк для оплаты</u>: {}\n'
                                 '<u>🔔 до занятия</u>: за {} ч. {} мин.\n'
                                 '<u>🕰 отправки расписания</u>: {}\n'
                                 '<u>🕰 отчета за день</u>: {}\n'
                                 '<u>Отмена занятий</u>: {} день/дня/дней\n',
    'student_management_menu': '🎎<b>УПРАВЛЕНИЕ УЧЕНИКАМИ</b>🎎\n\n'
                               'Выберите, что хотите сделать⤵️',
    'add_student': '➕ Добавить',
    'list_added': '📌 Зарегистрированные ученики',
    'list_debtors': '⛓️👮 Должники',
    'teacher_students': '👩🏻‍💻👩‍💻👩🏻‍💻ВАШИ УЧЕНИКИ👩🏻‍💻👩‍💻👩🏻‍💻\n\n'
                        'Уровни доступа:\n'
                        '    🔑 - доступ <b>открыт</b>\n'
                        '    🔒 - доступ <b>закрыт</b>\n\n'
                        'Нажмите на кнопку, чтобы поменять доступ!\n\n'
                        'Чтобы удалить ученика, нажмите на '
                        'РЕДАКТИРОВАНИЕ!',
    'list_added_students': '{} {} {}',
    'deleting': '✂️РЕДАКТИРОВАНИЕ✂️',
    'delete_student_by_teacher': '💀Нажми на кнопку, чтобы'
                                 ' удалить ученика💀',
    'input_student_id': 'Введите id ученика😸',
    'success_added': 'Ученик успешно добавлен!🧑/‍👩‍🦱',
    'not_success_added_id': 'Что-то пошло не плану...🙅‍♂️\n'
                            'Это не совсем похоже на id\n'
                            'Попробуйте снова!',
    'not_success_added_teacher': 'Ошибочка! Вы не можете добавлять\n'
                                 'преподавателей в качестве учеников!👮\n'
                                 'Попробуй еще раз ввести id!',
    'statistics_debtors': '🧮🧮СТАТИСТИКА ДОЛЖНИКОВ🧮🧮\n\n',
    'information_debtors': '{} {} пенальти: {}',
    'system_off': 'Система пенальти отключена!',
    'exit': 'Выйти',
    'has_not_students': 'У вас нет зарегистрированных учеников!',
    'success_lesson_paid': '✅<b>Занятие успешно оплачено</b>✅\n'
                           '<u>Дата проведения</u>: {} - {}\n'
                           '<u>Время проведения</u>: {}-{}\n',
    'success_remove_from_debts': '✅<b>Занятие удалено из задолженностей</b>✅\n'
                                 '<u>Дата:</u> {} - {}\n'
                                 '<u>Время:</u> {}-{}\n',
    'ok': 'Ок',
    'debtors_start_page': '👷‍♂️👷‍♂️👷‍♂️ДОЛЖНИКИ👷‍♂️👷‍♂️👷‍♂️\n\n'
                          '<i>Нажмите</i> на кнопку, чтобы увидеть подробную информацию✉️🫶',
    'line_debtor_information': '💲 {} {} {}',
    'confirmation': '✂️РЕДАКТИРОВАНИЕ✂️',
    'full_information_debtor': '🥶Информация о должнике🥶\n'
                               'Имя: {}\n'
                               'Фамилия: {}\n'
                               'Дата занятия: {}\n'
                               'Время занятия: {}-{}\n'
                               'Сумма: {} рублей',
    'not_show_list_debtors': 'В данный момент нет должников!',
    'change_list_debtors': '🔪ОТМЕНА ЗАДОЛЖЕННОСТИ🔪\n\n'
                           '<i>Нажмите</i> на кнопку, чтобы отменить '
                           'задолженность',
    'delete': '🙅 Отменить',
    'home': '🏚',
    'remove_from_debtors': 'Ученик удален из должников!',
    'description_header_teacher': 'Не работает? - /start\n',
    'description_lessons_week_teacher': '🎓🎓🎓 <b>ЗАНЯТИЯ</b> 🎓🎓🎓\n\n'
                                        'Выберите ⚡<b> день </b>⚡️, чтобы настроить своё расписание.\n\n'
                                        '📅 <b>Моё расписание</b>\n'
                                        '  Если занятия есть — откроется удобный список.\n'
                                        '   ❔ - никто не записался\n'
                                        '   ✅ - занятие <i>оплачено</i>\n'
                                        '   ❌ - занятие <i>не оплачено</i>\n'
                                        '  Нажмите на <b>время</b> ↩️, чтобы увидеть детали:\n'
                                        '    🙅 Отменить занятие (смотрите 🔔 <i>Уведомления</i>)\n\n'
                                        '✏️ <b>Редактирование</b>\n'
                                        '  1️⃣ 📝 <b>Добавить время занятий</b>\n'
                                        '    • Введите время для занятий\n'
                                        '    • Из этих слотов формируется Ваше расписание.\n'
                                        '  2️⃣ 🗑 <b>Удалить рабочее время</b>\n'
                                        '    • Удалите ненужное время одним нажатием.\n\n'
                                        '💰 <b>Платежи</b>\n'
                                        '  📍 Чтобы поменять статус оплаты достаточно нажать на кнопку с учеником',
    'description_management_students': '🎎 УПРАВЛЕНИЕ УЧЕНИКАМИ 🎎\n\n'
                                       '➕ <b>Добавить ученика</b>\n'
                                       '  Введите ID, который Вам скинул ученик\n\n'
                                       '📌 <b>Зарегистрированные ученики</b>\n'
                                       '  Список Ваших учеников, которые <i>Зарегистрировались</i>\n'
                                       '    🔑 - доступ <b>открыт</b>\n'
                                       '    🔒 - доступ <b>закрыт</b>\n'
                                       '    Нажмите на кнопку, чтобы ограничить доступ ученику\n'
                                       '  ️✂️<b>Редактирование</b>✂️ - меню для удаления учеников\n'
                                       '    Достаточно нажать на кнопку, чтобы <b>удалить</b> ученика🔪\n\n'
                                       '⛓️👮 <b>Должники</b>\n'
                                       '  Нажмите на кнопку, чтобы увидеть подробную информацию\n'
                                       '  ✂️<b>Редактирование</b>✂️ - меню для удаления должников\n'
                                       '  Достаточно нажать на кнопку, чтобы <b>удалить</b> должника📈',
    'description_settings_teacher': '️⚙⚙⚙ <b>️НАСТРОЙКИ</b> ⚙⚙⚙\n\n'
                                    '<b>🐸 Мои данные</b> - заполненные Вами данные\n'
                                    '<b>🔔 Уведомления</b> (смотри 🔔 <i>Уведомления</i>)\n'
                                    '<b>🔄 Заполнить профиль заново</b> - все данные,'
                                    ' кроме уведомлений обновляются\n'
                                    '<b>⛔Удалить профиль⛔</b> - все данные будут вместе с настройкой уведомлений будут'
                                    ' удалены из системы\n',
    'description_notifications_teacher': '🔔🔔🔔 <b>УВЕДОМЛЕНИЯ</b> 🔔🔔🔔\n\n'
                                         '<i>Настройка отдельно от <b>Регистрации</b></i>\n\n'
                                         '<b>3 вида уведомлений:</b>\n\n'
                                         '  1️⃣ Настраиваете сами:\n'
                                         '    ⏰ <b>Напоминание о занятии</b> (возможны задержки - '
                                         'данные обновляются каждые 5 минут)\n'
                                         '    🗓 <b>Расписание на день</b>\n'
                                         '    📅 <b>Отчет за день</b> - после отправки отчета Вам, всем ученикам, которые не '
                                         'оплатили занятие будет выслано уведомление о зачислении в ⛓️👮Должники \n'
                                         '    🚫 <b>Отмена занятий учениками</b>\n\n'
                                         '  2️⃣ Отправляете ученику:\n'
                                         '    🙅<b>Отменить</b> занятие - ученику придет уведомление об отмене занятия\n'
                                         '    ВАЖНО❗️ Уведомление об отмене занятия приходит только'
                                         ' из меню 📅 <b>Моё расписание</b>\n\n'
                                         '  3️⃣  Приходят от ученика:\n'
                                         '  • Подтверждение оплаты занятия\n'
                                         '  • Подтверждение оплаты для должника (после подтверждения автоматически '
                                         'удаляется из <i>списка должников</i>)\n\n'
                                         '<i>При повторном заполнении каких-либо уведомлений данные обновятся - можно '
                                         'отследить в <b>🐸 Мои данные</b></i>',

}
