LEXICON_TASKIQ = {
    'forget_paid_students': 'Вы не оплатили занятие {}\n'
                   'И добавлены в список должников!\n\n'
                   'Нажмите, чтобы подтвердить оплату!',
    'info_non_payment_teacher': 'Отчет за <u><b>{}</b></U>\n\n'
                                'Не оплатили занятие:\n{}',
    'info_payment_teacher': 'Отчет за <u><b>{}</b></U>\n\n'
                            'Все  оплатили занятия!',
    'info_non_lessons_today': 'Отчет за <u><b>{}</b></U>\n\n'
                              'Вы сегодня не проводили занятия!',
    'info_good_day': 'Отчет за <u><b>{}</b></U>\n\n'
                     'День подошел к концу!\n'
                     'У ваших учеников нет долгов!',
    'sent_student_payment_confirmation': '🚨<b>ПОДТВЕРДИТЕ ОПЛАТУ</b>🚨\n'
                                         '<u>Имя</u>: {}\n'
                                         '<u>Фамилия</u>: {}\n'
                                         '<u>Предмет</u>: {}\n'
                                         '<u>Дата проведения</u>: {} ({})\n'
                                         '<u>Время проведения</u>: {}-{}\n'
                                         '<u>Стоимость</u>: {} рублей\n\n',
    'confirm_payment_student': 'Подтвердить',
}