LEXICON_TEACHER = {
    'authorization': 'Авторизация',
    'registration': 'Регистрация',
    'menu_identification': '🔔<b>МЕНЮ ИДЕНТИФИКАЦИИ</b>🔔\n\n'
                           'Вы можете:\n'
                           '    - <u>авторизоваться</u> (если уже зарегистрированы)\n'
                           '    - <u>зарегистрироваться</u> (если заходите в первый раз)',
    'fill_name': 'Пожалуйста, введите ваше имя!⤵️',
    'not_fill_name': 'Упс! Ошибка! Что-то не похоже на имя!\n'
                     'Попробуйте еще раз!😉',
    'fill_surname': "Спасибо! А теперь введите\nвашу фамилию!☺️",
    'not_fill_surname': 'Упс! Ошибка! Что-то не похоже на фамилию!\n'
                        'Попробуйте еще раз!☺️',
    'fill_phone': 'Успех!\nСейчас потребуется ваш номер телефона!📞\n'
                  'Формат ввода: +7...(10 цифр вместо многоточия)',
    'not_fill_phone': 'Что-то пошло не так... Попробуйте еще раз!😇\n'
                      'Формат ввода: +7...(10 цифр вместо многоточия),\n'
                      'Например: +79108872307',
    'fill_bank': 'Идем дальше! Введите названия банка/банков💸\n'
                 'Если хочешь написать несколько банков, то '
                 'пиши через "/".\nДругой вариант '
                 'система не засчитает!💰\n'
                 'Пример ввода одного и нескольких банков:\n'
                 '    1. АльфаБанк\n'
                 '    2. Сбербанк/Тинькофф',
    'not_fill_bank': 'Не совсем похоже на название банка!\n'
                     'Может ты забыл, что кроме букв можно '
                     'использовать только "/"!🧐\n'
                     'Попробуй еще раз!😋',
    'fill_penalty': 'Почти все! Здесь мы поработаем с '
                    '<b>системой пенальти</b>!⚽️\n Варианты ввода:\n'
                    '    1. <u>0</u> - если не хотите, чтобы система работала🤷\n'
                    '    2. <u>Количество часов</u>, за которое у ученика'
                    ' будет закрываться отмена занятий!🙆‍♀️',
    'not_fill_penalty': 'Кажется вы ввели не число!😞\n'
                        'Варианты ввода:\n'
                        '    1. <u>0</u> - если не хотите,\n чтобы система работала🤷\n'
                        '    2. <u>Количество часов</u>, за которое у ученика🙆‍♀️'
                        'будет закрываться отмена занятий!☺️',
    'access_registration_profile': '<b>💥💥Вы зарегистрированы!💥💥</b>\n\n',
    'back': '<<',
    'go_menu_identification': 'Перейти в меню идентификации',
    'schedule_teacher': 'Редактирование расписания',
    'confirmation_pay': 'Подтверждение оплаты',
    'schedule_show': 'Мое расписание',
    'settings_teacher': 'Настройки профиля',
    'management_students': 'Управление учениками',
    'main_menu_authorization': '👑👑👑<b>ГЛАВНОЕ МЕНЮ</b>👑👑👑\n\n'
                               'В меню ниже выберите то, что хотите сделать⤵️',
    'schedule_teacher_menu': 'Давайте поработаем с настройкой вашего расписания'
                             ' на 7 дней вперед!🏋️‍♂️\nВыберите день для работы!',
    'next_seven_days_kb': '⚡️{} - {}⚡️',
    'schedule_changes_add_remove': 'Вы можете:\n'
                                   '    1. <u>Добавить</u> временный '
                                   'промежуток для занятий\n'
                                   '    2. <u>Удалить</u> временный '
                                   'промежуток занятий',
    'add_gap_teacher': 'Добавить📝',
    'remove_gap_teacher': 'Удалить🗑️️',
    'add_time_start': 'Вам надо ввести <u>время начала</u> и <u>время '
                      'окончания</u> рабочего промежутка!⏰\n\n'
                      'Давайте начнем!\n\n'
                      'Введите <u>время начала занятий</u> в формате '
                      '<b>‼️ЧАСЫ:МИНУТЫ‼️</b>\n'
                      'Например:\n'
                      '    1. 12:30\n'
                      '    2. 03:04\n'
                      '    3. 18:00',
    'not_correct_format_time': 'Что-то пошло не так...😢\nВремя не '
                               'соответствует формату <b>‼️ЧАСЫ:МИНУТЫ‼️</b>\n'
                               'Примеры:\n'
                               '    1. 12:30\n'
                               '    2. 03:04\n'
                               '    3. 18:00\n'
                               'Попробуйте еще раз!',
    'new_day_not_near': 'Увы! Но вы не можете вводить время старта '
                        'после 23:30 - не получится выставить слот😌\n\n'
                        'Минимальная длина слота - 30 минут\n\n'
                        'Формата ввода:\n <b>‼️ЧАСЫ:МИНУТЫ‼️</b>\n'
                        'Попробуйте еще раз!',
    'conflict_with_penalty': 'Что-то пошло не так...\n'
                             'Ученики будут попадать под пенальти🤷‍♂️\n'
                             'Время, с которого начинаются пенальти: <b>{}</b>'
                             '(уже наступило)\n'
                             'Веденное время: <b>{}</b>\n\n'
                             'Попробуйте еще раз!',
    'time_has_passed': 'Упс...😿 Введенное время уже наступило!\n'
                       'Попробуйте снова!',
    'start_conflict_with_existing': 'Ошибка ввода⚠️ Стартовое время'
                                    ' пересекается/будет пересекаться с уже существующим!\n\n'
                                    'Список существующих записей:\n{}\n\n'
                                    'Введенное время старта занятий: <b>{}</b>\n'
                                    'Попробуйте еще раз!',
    'add_time_start_right': 'Данные успешно сохранены!👌',
    'not_difference_thirty_min': "Время работы меньше 30 минут⛔️"
                                 "Введенное время старта занятий: <b>{}</b>"
                                 "\nВведите заново конец занятий!",
    'add_time_end': 'Введите <u>время окончания занятий</u> в формате '
                    '<b>‼️ЧАСЫ:МИНУТЫ‼️</b>\n'
                    'Например:\n'
                    '    1. 12:30\n'
                    '    2. 03:04\n'
                    '    3. 18:00',
    'end_bigger_start': "Упс...😿Время окончания занятий наступает раньше"
                        "стартового времени!\n"
                        "Время старта занятий: <b>{}</b>\n"
                        "Попробуйте снова!",
    'end_conflict_with_existing': 'Ошибка ввода⚠️ Время окончания '
                                  'пересекается/будет пересекаться'
                                  ' с уже существующим!\n\n'
                                  'Список существующих записей:\n{}\n\n'
                                  'Введенное время старта занятий: <b>{}</b>\n'
                                  'Попробуйте еще раз!',
    'delete_time_start': 'Выберите временной интервал для удаления!😉',
    'nothing_delete_teacher_time': 'Еще не установлено расписание!',
    'confirmation_pay_menu': '💸💸💸<b>МЕНЮ ОПЛАТЫ</b>💸💸💸\n\n'
                             'Выберите день, в котором хотите поработать '
                             ' с оплатой занятий\n',
    'change_status_pay_menu': '<b>Нажмите</b> на кнопку, чтобы поменять статус '
                              'оплаты!\n'
                              '    ✅ - Оплачено\n'
                              '    ❌ - Не оплачено',
    'nobody_choose_lessons': "В данный момент никто не выбрал занятия!",
    'next_seven_days_pay_kb': '💰{} - {}💰'

}
