LEXICON_TASKIQ = {
    'forget_paid_students': 'Вы не оплатили занятие {}\n'
                   'И добавлены в список должников!\n\n'
                   'Нажмите, чтобы подтвердить оплату!',
    'info_non_payment_teacher': '<b>👑👑👑ОТЧЕТ ЗА <u><b>{}</b></u></b>👑👑👑\n\n'
                                '🕰<b>Время работы</b>🕰: {}\n'
                                '💸<b>Заработок</b>💸: {} руб.\n'
                                '👮🏾‍♂️<b>Долг учеников</b>️👮🏾‍♂️: {} руб.\n'
                                '😤<b>Должники</b>😤\n{}',
    'info_payment_teacher': 'Отчет за <u><b>{}</b></U>\n\n'
                            'Все  оплатили занятия!',
    'info_non_lessons_today': 'Отчет за <u><b>{}</b></U>\n\n'
                              'Вы сегодня не проводили занятия!',
    'info_good_day': 'Отчет за <u><b>{}</b></U>\n\n'
                     'День подошел к концу!\n'
                     'У ваших учеников нет долгов!',
}