LEXICON_STUDENT = {
    'authorization': '👤 Авторизация',
    'registration': '🆕 Регистрация️',
    'menu_identification': '🚪🚪🚪<b>МЕНЮ ВХОДА</b>🚪🚪🚪\n\n'
                           'Ты можешь:\n'
                           '    - <u>авторизоваться</u> (если уже зарегистрированы)\n'
                           '    - <u>зарегистрироваться</u> (если заходите в первый раз)',
    'fill_name': 'Пожалуйста, введите ваше имя!⤵️',
    'not_fill_name': 'Упс! Ошибка! Что-то не похоже на имя!\n'
                     'Попробуй еще раз!😉',
    'fill_surname': "Спасибо! А теперь введите\nвашу фамилию!☺️",
    'not_fill_surname': 'Упс! Ошибка! Что-то не похоже на фамилию!\n'
                        'Попробуй еще раз!☺️',
    'fill_city': 'Хорошо идем! Теперь укажи из какого ты города!🌇',
    'not_fill_city': 'Не совсем похоже на название города!😉\n'
                     'Я уверен, что у тебя все получится!\n'
                     'Попробуй еще раз!',
    'fill_place_study': '🎓 <b>Где ты учишься?</b>\n\n'
                        'Расскажи о своём учебном заведении — просто и понятно!\n\n'
                        '<b>Примеры оформления:\n</b>'
                        '    1️⃣ Школа №56\n'
                        '    2️⃣ ПГУПС\n'
                        '    3️⃣ Горный университет\n\n'
                        '📌 <b>Важно</b>\n'
                        'Пиши так, чтобы преподаватель сразу понял, где'
                        ' ты грызёшь гранит науки! 😉\n',
    'fill_level_choice': 'Спасибо! Пора определиться, что тебе больше'
                         ' подходит📝↩️\n'
                         'Нажми на кнопку из меню!',
    'not_fill_level_choice': 'Ничего писать не надо!\n'
                             'Выбери вариант из меню ниже!😉',
    'fill_class': 'Введи класс своего обучения!😌',
    'not_fill_class': 'Не совсем похоже на допустимое число!\n'
                      'Попробуй еще раз!😀',
    'fill_course': 'Введи курс своего обучения!😌',
    'not_fill_course': 'Не совсем похоже на допустимое число!\n'
                       'Попробуй еще раз!😀',
    'fill_subject': 'Давай продолжим! Введи предмет, по которому ты'
                    ' будешь заниматься🔖',
    'not_fill_subject': 'Упс! Ошибка! Что-то не похоже на предмет!\n'
                        'Попробуй еще раз!😉',
    'fill_teacher': 'Пора определиться с преподавателем!\n'
                    'Выбери своего!👑',
    'fill_price': 'Почти закончили!\nНапиши стоимость твоего'
                  ' занятия за час в рублях!💰',
    'not_fill_price': 'Не совсем похоже на стоимость занятий!💰\n'
                      'Попробуй еще раз!',
    'course_learning': 'Курс обучения',
    'class_learning': 'Класс обучения',
    'fill_until_time_notification': '⏰ <b>За какое время до занятия присылать'
                                    ' уведомление?</b>\n\n'
                                    'Формат времени <b><u>ЧАСЫ:МИНУТЫ</u></b>\n'
                                    '✨ Например:\n'
                                    '  • 01:30 — за полтора часа\n'
                                    '  • 24:00 — за сутки\n'
                                    '  • 03:00 — за три часа\n\n'
                                    '📌 Диапазон значений:'
                                    ' от <b>00:01</b> до <b>99:99</b>',
    'not_fill_until_time_notification': '😊 <b>Ой, кажется, формат не распознан!</b>\n\n'
                                        'Попробуйте еще раз!\n'
                                        'Формат времени <b><u>ЧАСЫ:МИНУТЫ</u></b>\n'
                                        '✨ Например:\n'
                                        '  • 01:30 — за полтора часа\n'
                                        '  • 24:00 — за сутки\n'
                                        '  • 03:00 — за три часа\n\n'
                                        '📌 Диапазон значений:'
                                        ' от <b>00:01</b> до <b>99:99</b>\n\n'
                                        'Вы почти у цели! ✨',
    'access_registration_profile': '<b>💥💥Вы зарегистрированы!💥💥</b>',
    'now_registered': 'Вы уже зарегистрированы!',
    'not_registered': 'Вы еще не зарегистрированы!',
    'back': '<<',
    'go_menu_identification': 'В меню входа⤵️',
    'header_seven_days_student': '📍 Внизу находятся кнопки с датам на неделю вперед.\n'
                                 '🗓️ Выберите <i><b>день</b></i>, с которым хотите поработать!',
    'header_config_student': '📌📌📌 <b>{} - {}</b> 📌📌📌\n\n'
                             '[ 📅 ] <b>Моё расписание</b>\n'
                            'Твои занятия на день\n'
                            '[ ✏️ ] <b>Редактирование</b>\n'
                            'Добавить или удалить время занятия\n',
    'lessons_student': '🎓 Занятия',
    'show_schedule': '📅 Мое расписание',
    'settings_schedule': '✏ Редактирование',
    'penalties': '🎯 Пенальти',
    'settings_student': '️⚙ ️Настройки',
    'main_menu_authorization': '👑👑👑<b>ГЛАВНОЕ МЕНЮ</b>👑👑👑\n\n'
                               'В меню ниже выберите то, что хотите сделать⤵️',
    'next_seven_days_kb': '⚡️{} - {}⚡️',
    'schedule_student_menu': 'Давай поработаем с настройкой твоего расписания'
                             ' на 7 дней вперед!🏋️‍♂️\nВыбери день для занятий!',
    'schedule_changes_add_remove': '🛠 <b>Доступные действия:</b>\n'
                                    '  • 📝 <i>Добавить</i> время занятий\n'
                                    '  • 🗑 <i>Удалить</i> учебное время',
    'add_gap_student': '📝 Добавить',
    'remove_gap_student': '🗑 Удалить️️',
    'choose_slot_penalty': '🔥Выберите слоты для занятия!🔥\n\n'
                           'Слоты суммируются!\n\n'
                           'Учитывайте, что все слоты\nпо <i><b>30 минут</b></i>\n\n'
                           'Время до отмены занятий:<i><b> за {}</b></i> ч.',
    'choose_slot': '🔥Выберите слоты для занятия!🔥\n\n'
                   '⏳ <i>Слоты суммируются!</i>\n\n'
                   '📍Учитывайте, что все слоты по <i><b>30 минут</b></i>',
    'teacher_not_create_slots': "Преподаватель еще не выставил слоты!",
    'not_free_slots': 'Свободных слотов нет!',
    'exit': 'Выйти',
    'move_left': '<',
    'move_right': '>',
    'free_slot': '{} - {}',
    'delete_slot': '🚀 <b>Время для чистки!</b>\n'
                        '<i>Отметьте</i> промежуток, который нужно удалить',
    'nothing_remove': 'Нечего удалять!',
    'time_delete_expired': 'Время удаления истекло! Оплатите занятие!',
    'can_not_move': 'Двигаться некуда!',
    'my_schedule_menu': '📖📖<b>МЕНЮ С РАСПИСАНИЕМ📖📖</b>\n\n'
                        'Выберите день, в котором хотите посмотреть '
                        'Ваше расписание⤵️',
    'next_seven_days_schedule_student_kb': '🎓{} - {}🎓',
    'schedule_lesson_day': '📌📌📌 <b>{} - {}</b> 📌📌📌\n\n'
                           '🔍 Нажмите на <b><i>кнопку</i></b> — узнайте все детали! 🔍',
    'not_choose_gaps': 'В данный момент нет выбранных занятий!',
    'all_lessons_for_day_kb': '↪️{} - {}',
    'information_about_lesson_penalty': '🦾🦾🦾<b>Данные о занятии</b>🦾🦾🦾\n'
                                        '<u>Преподаватель</u>: {} {}\n'
                                        '<u>Время проведения</u>: {}-{}\n'
                                        '<u>Номер для перевода</u>: <code>{}</code>\n'
                                        '<u>Банк/Банки</u>: {}\n'
                                        '<u>Стоимость</u>: <code>{}</code> рублей\n'
                                        '<u>Время до пенальти</u>: <b>{}</b>\n\n'
                                        '<b>{}</b>',
    'information_about_lesson': '🦾🦾🦾<b>Данные о занятии</b>🦾🦾🦾\n'
                                '<u>Преподаватель</u>: {} {}\n'
                                '<u>Время проведения</u>: {}-{}\n'
                                '<u>Номер для перевода</u>: <code>{}</code>\n'
                                '<u>Банк/Банки</u>: {}\n'
                                '<u>Стоимость</u>: <code>{}</code> рублей\n'
                                '<b>{}</b>',
    'text_penalty_expired': '\n🔴НАСТУПИЛО🔴',
    'text_penalty_not_expired': '🟢{}🟢 (ЧАСЫ:МИНУТЫ)',
    'menu_settings': '⚙️⚙️⚙️⚙️<b>НАСТРОЙКИ</b>⚙️⚙️⚙️⚙️\n\n'
                     '  🔹 При обновлении профиля ваши текущие занятия <b><i>сохранятся</i></b>\n'
                     '  🔹 При удалении профиля все записи о занятиях будут безвозвратно <b><i>удалены</i></b>.\n\n'
                     '💡 Изменяйте данные аккуратно!',
    'information_student': '🐸 Мои данные',
    'registration_again': '🔄 Заполнить профиль заново',
    'delete_profile': '⛔Удалить профиль⛔',
    'information_about_student': '🐸🐸🐸<b>Информацию о Вас</b>🐸🐸🐸\n'
                                 '<u>Имя</u>: {}\n'
                                 '<u>Фамилия</u>: {}\n'
                                 '<u>Город</u>: {}\n'
                                 '<u>Место учебы</u>: {}\n'
                                 '<u>Класс/курс</u>: {}\n'
                                 '<u>Предмет</u>: {}\n'
                                 '<u>Цена занятия</u>: {} руб/час\n'
                                 '<u>🔔 до занятия</u>: за {} ч. {} мин.\n',
    'student_payment_confirmation_good': 'Запрос на подтверждение отправлен!',
    'confirm_lesson': '🔥 Подтвердить',
    'already_confirm_lesson': 'Оплата уже подтверждена!',
    'system_off': 'Система пенальти отключена!',
    'has_not_penalty': 'У вас нет пенальти!',
    'penalty_menu': '👮🚨👮<b>МОИ ПЕНАЛЬТИИ</b>👮🚨👮\n\n'
                    'До <b><i>бана</i></b>: {} пенальти',
    'information_penalty': '{} {} - {}',
    'sent_student_payment_confirmation': '🚨<b>ПОДТВЕРДИТЕ ОПЛАТУ</b>🚨\n'
                                         '<u>Имя</u>: {}\n'
                                         '<u>Фамилия</u>: {}\n'
                                         '<u>Предмет</u>: {}\n'
                                         '<u>Дата проведения</u>: {} ({})\n'
                                         '<u>Время проведения</u>: {}-{}\n'
                                         '<u>Стоимость</u>: {} рублей\n\n',
    'sent_debtor_payment_confirmation': '🚨<b>ОПЛАТА ДОЛЖНИКА</b>🚨\n'
                                         '<u>Имя</u>: {}\n'
                                         '<u>Фамилия</u>: {}\n'
                                         '<u>Предмет</u>: {}\n'
                                         '<u>Дата проведения</u>: {} ({})\n'
                                         '<u>Время проведения</u>: {}-{}\n'
                                         '<u>Стоимость</u>: {} рублей\n\n',
    'confirm_payment_student': 'Подтвердить',
    'cancel': '🙅 Отменить',
    'student_cancellation_lesson': '❌ОТМЕНА ЗАНЯТИЯ❌\n'
                                   '<u>Ученик</u>: {} {}\n'
                                   '<u>Дата проведения</u>: {} ({})\n'
                                   '<u>Время проведения</u>: {}-{}\n',
    'ok': 'Ок',
    'debts': '💢 Задолженности',
    'debts_header': '🚔🚔<b>ЗАДОЛЖЕННОСТИ</b>🚔🚔\n\n',
    'debt_information': '{} {}:{} {} рублей',
    'no_debts': 'У вас нет задолженностей!',
    'to_schedule': 'К расписанию↩️',
    'notifications_student': '🔔 Уведомления',
    'header_notifications': '🔔🔔🔔<b>УВЕДОМЛЕНИЯ</b>🔔🔔🔔\n\n'
                            '<i>Нажмите</i> на кнопку, чтобы установить или поменять '
                            '<u>время</u>',
    'until_time_notification_button': '⏰ Напоминание о занятии',
    'congratulations_edit_notices': '💥💥Данные сохранены!💥💥',
}
