LEXICON_TASKIQ = {
    'forget_paid_students': '🚨ВЫ В СПИСКЕ ДОЛЖНИКОВ!🚨\n\n'
                            '📆<b>Дата</b>📆: {}\n'
                            '⌚️<b>Время занятия</b>⌚️: {} - {}\n'
                            '👮🏾‍♂️💸<b>Сумма</b>👮🏾‍♂️💸: {} руб.\n\n',
                            # 'Нажмите на кнопку, чтобы отправить запрос для подтверждения оплаты!',
    'info_non_payment_teacher': '<b>👑👑👑ОТЧЕТ ЗА <u><b>{}</b></u></b>👑👑👑\n\n'
                                '🕰<b>Время работы</b>🕰: {}\n'
                                '💸<b>Заработок</b>💸: {} руб.\n'
                                '👮🏾‍♂️<b>Долг учеников</b>️👮🏾‍♂️: {} руб.\n'
                                '😤<b>Должники</b>😤\n{}',
    'info_payment_teacher': 'Отчет за <u><b>{}</b></U>\n\n'
                            'Все  оплатили занятия!',
    'info_non_lessons_today': 'Отчет за <u><b>{}</b></U>\n\n'
                              'Вы сегодня не проводили занятия!',
    'info_good_day': 'Отчет за <u><b>{}</b></U>\n\n'
                     'День подошел к концу!\n'
                     'У ваших учеников нет долгов!',
    'ok': 'Ок',
    'confirm_payment_student': 'Подтвердить',
    'notice_lesson_certain_time_student': 'Уважаемый <b>{}</b>!\n'
                                          'Ваше занятие начнется через <u>{}</u> минут!',
    'give_everyday_schedule': 'Ваше расписание на день!\n'
                              '{}',
    'time_before_lesson_student': '🔔🔔🔔УВЕДОМЛЕНИЕ🔔🔔🔔\n'
                                  '<u>До занятия:</u> {} ч. {} мин.\n'
                                  '<u>Начнется:</u> {}',
    'time_before_lesson_teacher': '🔔🔔🔔УВЕДОМЛЕНИЕ🔔🔔🔔\n'
                                  'Ученик: {} {}\n'
                                  'Предмет: {}\n'
                                  'До занятия: {} ч. {} мин.\n'
                                  'Начнется: {}'
}