LEXICON_STUDENT = {
    'authorization': 'Авторизация',
    'registration': 'Регистрация',
    'menu_identification': '🔔<b>МЕНЮ ИДЕНТИФИКАЦИИ</b>🔔\n\n'
                           'Вы можете:\n'
                           '    - <u>авторизоваться</u> (если уже зарегистрированы)\n'
                           '    - <u>зарегистрироваться</u> (если заходите в первый раз)',
    'fill_name': 'Пожалуйста, введите ваше имя!⤵️',
    'not_fill_name': 'Упс! Ошибка! Что-то не похоже на имя!\n'
                     'Попробуй еще раз!😉',
    'fill_surname': "Спасибо! А теперь введите\nвашу фамилию!☺️",
    'not_fill_surname': 'Упс! Ошибка! Что-то не похоже на фамилию!\n'
                        'Попробуй еще раз!☺️',
    'fill_city': 'Хорошо идем! Теперь укажи из какого ты города!🌇',
    'not_fill_city': 'Не совсем похоже на название города!😉\n'
                     'Я уверен, что у тебя все получится!\n'
                     'Попробуй еще раз!',
    'fill_place_study': 'Супер! А теперь напиши, где ты учишься✌️\n'
                        'Например:\n'
                        '    1. Школа 56\n'
                        '    2. ПГУПС\n'
                        '    3. Горный \n'
                        'Пиши так, чтобы преподаватель понял, где ты'
                        ' учишься!😉',
    'fill_level_choice': 'Спасибо! Пора определиться, что тебе больше'
                         ' подходит📝↩️\n'
                         'Нажми на кнопку из меню!',
    'not_fill_level_choice': 'Ничего писать не надо!\n'
                             'Выбери вариант из меню ниже!😉',
    'fill_class': 'Введи класс своего обучения!😌',
    'not_fill_class': 'Не совсем похоже на допустимое число!\n'
                      'Попробуй еще раз!😀',
    'fill_course': 'Введи курс своего обучения!😌',
    'not_fill_course': 'Не совсем похоже на допустимое число!\n'
                       'Попробуй еще раз!😀',
    'fill_subject': 'Давай продолжим! Введи предмет, по которому ты'
                    ' будешь заниматься🔖',
    'not_fill_subject': 'Упс! Ошибка! Что-то не похоже на предмет!\n'
                        'Попробуй еще раз!😉',
    'fill_teacher': 'Пора определиться с преподавателем!\n'
                    'Выбери своего!👑',
    'fill_price': 'Почти закончили!\nНапиши стоимость твоего'
                  ' занятия за час в рублях!💰',
    'not_fill_price': 'Не совсем похоже на стоимость занятий!💰\n'
                      'Попробуй еще раз!',
    'course_learning': 'Курс обучения',
    'class_learning': 'Класс обучения',
    'access_registration_profile': '<b>💥💥Вы зарегистрированы!💥💥</b>',
    'now_registered': 'Вы уже зарегистрированы!',
    'not_registered': 'Вы еще не зарегистрированы!',
    'back': '<<',
    'go_menu_identification': 'Перейти в меню идентификации',
    'show_schedule': 'Мое расписание',
    'settings_schedule': 'Запись на занятия',
    'penalties': 'Пенальти',
    'settings_student': 'Настройки профиля',
    'main_menu_authorization': '👑👑👑<b>ГЛАВНОЕ МЕНЮ</b>👑👑👑\n\n'
                               'В меню ниже выберите то, что хотите сделать⤵️',
    'next_seven_days_kb': '⚡️{} - {}⚡️',
    'schedule_student_menu': 'Давай поработаем с настройкой твоего расписания'
                             ' на 7 дней вперед!🏋️‍♂️\nВыбери день для занятий!',
    'schedule_changes_add_remove': 'Вы можете:\n'
                                   '    1. <u>Выбрать</u> временной '
                                   'слот для занятия\n'
                                   '    2. <u>Удалить</u> временной '
                                   'слот для занятия',
    'add_gap_student': 'Выбрать📝',
    'remove_gap_student': 'Удалить🗑️️',
    'choose_slot_penalty': '🔥Выберите слоты для занятия!🔥\n\n'
                           'Слоты суммируются!\n\n'
                           'Учитывайте, что все слоты\nпо <i><b>30 минут</b></i>\n\n'
                           'Время до отмены занятий:<i><b> за {}</b></i> ч.',
    'choose_slot': '🔥Выберите слоты для занятия!🔥\n\n'
                   'Слоты суммируются!\n\n'
                   'Учитывайте, что все слоты\nпо <i><b>30 минут</b></i>',
    'teacher_not_create_slots': "Преподаватель еще не выставил слоты!",
    'not_free_slots': 'Свободных слотов нет!',
    'exit': 'выйти',
    'move_left': '<<',
    'move_right': '>>',
    'free_slot': '{} - {}',
    'delete_slot': 'Выберите временной слот для удаления!😉\n',
    'nothing_remove': 'Нечего удалять!',
    'time_delete_expired': 'Время удаления истекло! Оплатите занятие!',
    'can_not_move': 'Двигаться некуда!',
    'my_schedule_menu': '📖📖<b>МЕНЮ С РАСПИСАНИЕМ📖📖</b>\n\n'
                        'Выберите день, в котором хотите посмотреть '
                        'Ваше расписание⤵️',
    'next_seven_days_schedule_student_kb': '🎓{} - {}🎓',
    'schedule_lesson_day': '🌠<b>Нажми</b> на кнопку, \nчтобы увидеть'
                           ' подробную информацию!🌠\n',
    'not_choose_gaps': 'В данный момент нет выбранных занятий!',
    'all_lessons_for_day_kb': '↪️{} - {}',
    'information_about_lesson_penalty': '🦾🦾🦾<b>Данные о занятии</b>🦾🦾🦾\n'
                                        '<u>Преподаватель</u>: {} {}\n'
                                        '<u>Время проведения</u>: {}-{}\n'
                                        '<u>Номер для перевода</u>: <code>{}</code>\n'
                                        '<u>Банк/Банки</u>: {}\n'
                                        '<u>Стоимость</u>: <code>{}</code> рублей\n'
                                        '<u>Время до пенальти</u>: <b>{}</b>\n\n'
                                        '<b>{}</b>',
    'information_about_lesson': '🦾🦾🦾<b>Данные о занятии</b>🦾🦾🦾\n'
                                '<u>Преподаватель</u>: {} {}\n'
                                '<u>Время проведения</u>: {}-{}\n'
                                '<u>Номер для перевода</u>: <code>{}</code>\n'
                                '<u>Банк/Банки</u>: {}\n'
                                '<u>Стоимость</u>: <code>{}</code> рублей\n'
                                '<b>{}</b>',
    'text_penalty_expired': '\n🔴НАСТУПИЛО🔴',
    'text_penalty_not_expired': '🟢{}🟢 (ЧАСЫ:МИНУТЫ)',
    'menu_settings': '⚙️⚙️⚙️⚙️<b>НАСТРОЙКИ</b>⚙️⚙️⚙️⚙️\n\n'
                     'При <u>заполнении профиля заново</u> существующие'
                     ' записи о занятиях <i><b>не удалятся!</b></i>\n'
                     'При <u>удалении профиля</u> все записи о занятиях'
                     ' <i><b>удалятся</b></i>!',
    'information_student': 'Информация обо мне',
    'registration_again': 'Заполнить профиль заново',
    'delete_profile': '⛔Удалить профиль⛔',
    'information_about_student': 'Таким образом преподаватель видит'
                                 ' информацию о Вас🐸:\n'
                                 '<u>Имя</u>: {}\n'
                                 '<u>Фамилия</u>: {}\n'
                                 '<u>Город</u>: {}\n'
                                 '<u>Место учебы</u>: {}\n'
                                 '<u>Класс/курс</u>: {}\n'
                                 '<u>Предмет</u>: {}\n'
                                 '<u>Цена занятия</u>: {} руб/час\n',
    'student_payment_confirmation_good': 'Запрос на подтверждение отправлен!',
    'confirm_lesson': 'Подтвердить',
    'already_confirm_lesson': 'Оплата уже подтверждена!',
    'system_off': 'Система пенальти отключена!',
    'has_not_penalty': 'У вас нет пенальти!',
    'penalty_menu': '👮🚨👮<b>МОИ ПЕНАЛЬТИИ</b>👮🚨👮\n\n'
                    'До <b><i>бана</i></b>: {} пенальти',
    'information_penalty': '{} {} - {}',
    'sent_student_payment_confirmation': '🚨<b>ПОДТВЕРДИТЕ ОПЛАТУ</b>🚨\n'
                                         '<u>Имя</u>: {}\n'
                                         '<u>Фамилия</u>: {}\n'
                                         '<u>Предмет</u>: {}\n'
                                         '<u>Дата проведения</u>: {} ({})\n'
                                         '<u>Время проведения</u>: {}-{}\n'
                                         '<u>Стоимость</u>: {} рублей\n\n',
    'confirm_payment_student': 'Подтвердить',

}


