LEXICON_ALL = {
    'start': '<b>Добро пожаловать! v1.1 beta</b>\n\n'
             '/help_student - если ты ученик\n'
             '/help_teacher - если ты преподаватель\n\n'
             'Чтобы начать пользоваться выбери роль!',
    'help_student': '/start - чтобы начать пользоваться\n'
                    '/start - что-то пошло не так\n'
                    '@username_to_id_bot - твой id',

    'help_teacher': '/start - чтобы начать пользоваться\n'
                    '/start - что-то пошло не так\n'
                    '@username_to_id_bot - твой id',
    'payed_right': '✅ Оплата принята ✅',
    'payed_not_right': '❌ Ожидается оплата ❌',
    'incorrect_input': 'Что-то пошло не так...\n'
                       'Я не знаю, что ответить🤷‍♂️🤷‍♀️🤷\n'
                       'Нажми /start, чтобы начать заново',
    'give_id': '<b>Ваш id: <code>{}</code></b>',
    'ok': 'Ок',
}

LEXICON_MENU = {
    '/start': 'Начало работы бота',
    '/help_student': 'Справочник для ученика',
    '/help_teacher': 'Справочник для преподавателя'
}
